---
kind: type
id: T:Autodesk.Revit.DB.PlanCircuitSet
source: html/8398c79d-1108-6846-cc0c-b7b2b5c1d026.htm
---
# Autodesk.Revit.DB.PlanCircuitSet

A set that can contain any number of plan circuit objects.

## Syntax (C#)
```csharp
public class PlanCircuitSet : APIObject,
	IEnumerable
```